kolokwium2/kolokwium.tex
% Created 2020-12-14 pon 18:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Patryk Kaniewski}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Patryk Kaniewski},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents \clearpage\section{intro}
\label{sec:orgf81048c}
p \^{} s -> q
r V s \^{} (\textasciitilde{}p) -> \textasciitilde{}q
r \^{} s \^{} q -> q
\section{przetworzone}
\label{sec:org8246705}
p \^{} s -> q
r V (s \^{}\textasciitilde{}p) -> \textasciitilde{}q
r \^{} s \^{} q -> p


\section{proof}
\label{sec:orgb61df05}
rozpatrzamy przypadki z P=1 i Q=1 oraz dowolna kombinacja R i S

\begin{itemize}
\item "jeżeli pacjent ma jednocześnie nadciśnienie i wysokie tętno można mu podać którykolwiek z leków."
\end{itemize}
\subsection{template pqrs}
\label{sec:org5fefe0d}
\begin{verbatim}
(p ^ s -> q) ^ (r V (s ^~p) -> ~q) ^ (r ^ s ^ q -> p)
p v q -> r v s
\end{verbatim}
\subsection{TTTT}
\label{sec:org5816a15}
\subsubsection{lewo}
\label{sec:orgf12e3ae}
\begin{verbatim}
(1 ^ 1 -> 1) ^ (1 V (1 ^ ~1) -> ~1) ^ (1 ^ 1 ^ 1 -> 1)
(1 -> 1)     ^ (1 V (1 ^ 0) -> 0)   ^ (1 ^ 1 -> 1)
(1)          ^ (1 V 0 -> 0)         ^ (1 -> 1)
(1)          ^ (1 -> 0)             ^ (1 -> 1)
(1)          ^ (0)                  ^ (1)
0
\end{verbatim}
\subsubsection{prawo}
\label{sec:orgb6e0290}
\begin{verbatim}
1 v 1 -> 1 v 1
1 -> 1
1
\end{verbatim}
\subsubsection{0 != 1}
\label{sec:org80fbaf9}

\subsection{TTTF}
\label{sec:org48a26ad}
\subsubsection{lewo}
\label{sec:org4bd87dd}
\begin{verbatim}
(1 ^ 0 -> 1) ^ (1 V (0 ^ ~1) -> ~1) ^ (1 ^ 0 ^ 1 -> 1)
(0 -> 1)     ^ (1 V (0 ^ ~1) -> ~1) ^ (1 ^ 0 ^ 1 -> 1)
(0)          ^ (1 V (0 ^ ~1) -> ~1) ^ (1 ^ 0 ^ 1 -> 1)
0 //bo to jest AND wszystkiego
\end{verbatim}

\subsubsection{prawo}
\label{sec:orgcf5ba40}
\begin{verbatim}
1 v 1 -> 1 v 0
1 -> 1
1
\end{verbatim}
\subsubsection{0!=1}
\label{sec:org89cbaa3}
\subsection{TTFT}
\label{sec:org6795928}
\subsubsection{lewo}
\label{sec:org8c18315}
\begin{verbatim}
(1 ^ 1 -> 1) ^ (0 V (1 ^ 0) -> 0) ^ (0 ^ 1 ^ 1 -> 1)
(1 -> 1)     ^ (0 V (1 ^ 0) -> 0) ^ (0 -> 1)
(1 -> 1)     ^ (0 V (1 ^ 0) -> 0) ^ (1)
(1)          ^ (0 V (0) -> 0)     ^ (1)
(1)          ^ (0 -> 0)           ^ (1)
1 ^ 1 ^ 1

1
\end{verbatim}
\subsubsection{prawo}
\label{sec:org729d5a9}
\begin{verbatim}
1 v 1 -> 0 v 1
1 -> 1
1
\end{verbatim}
\subsubsection{1==1}
\label{sec:orgb635160}
\subsection{TTFF}
\label{sec:org3fe4ab0}
\subsubsection{lewo}
\label{sec:org1c9def0}
\begin{verbatim}
(0 -> 1) ^ (0 V (0 ^ 0) -> 0) ^ (0 ^ 0 ^ 1 -> 1)
(0 -> 1) ^ (0 V 0 -> 0)       ^ (0 -> 1)
1        ^ 1                  ^ 1
1
\end{verbatim}
\subsubsection{prawo}
\label{sec:org2ab0bae}
\begin{verbatim}
1 v 1 -> 0 v 0
1 -> 0
0
\end{verbatim}
\subsubsection{1!=0}
\label{sec:orgb225285}

\section{Wnioski}
\label{sec:org8c1bc06}
AND 3 warunkow i naszego celu "jeżeli pacjent ma jednocześnie nadciśnienie i wysokie tętno można mu podać
którykolwiek z leków." musialby byc rowny w 4 przypadkach zeby stwierdzenie bylo prawdziwe
\end{document}
